node {
  name: "global_step/Initializer/zeros"
  op: "Const"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step"
  op: "VarHandleOp"
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@global_step"
      }
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "shape"
    value {
      shape {
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: "global_step"
    }
  }
}
node {
  name: "global_step/IsInitialized/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/Assign"
  op: "AssignVariableOp"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/Read/ReadVariableOp"
  op: "ReadVariableOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
}
node {
  name: "global_step/VarIsInitializedOp"
  op: "VarIsInitializedOp"
  input: "global_step"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/cond"
  op: "If"
  input: "global_step/VarIsInitializedOp"
  input: "global_step"
  input: "global_step/Initializer/zeros"
  attr {
    key: "Tcond"
    value {
      type: DT_BOOL
    }
  }
  attr {
    key: "Tin"
    value {
      list {
        type: DT_RESOURCE
        type: DT_INT64
      }
    }
  }
  attr {
    key: "Tout"
    value {
      list {
        type: DT_INT64
      }
    }
  }
  attr {
    key: "_lower_using_switch_merge"
    value {
      b: true
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "else_branch"
    value {
      func {
        name: "global_step_cond_false_8356"
      }
    }
  }
  attr {
    key: "output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "then_branch"
    value {
      func {
        name: "global_step_cond_true_8355"
      }
    }
  }
}
node {
  name: "global_step/cond/Identity"
  op: "Identity"
  input: "global_step/cond"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "global_step/add/y"
  op: "Const"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT64
        tensor_shape {
        }
        int64_val: 0
      }
    }
  }
}
node {
  name: "global_step/add"
  op: "AddV2"
  input: "global_step/cond/Identity"
  input: "global_step/add/y"
  attr {
    key: "T"
    value {
      type: DT_INT64
    }
  }
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
        }
      }
    }
  }
}
node {
  name: "normalize_element/component_0"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 736
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 736
          }
        }
        string_val: "132925"
        string_val: "132921"
        string_val: "132922"
        string_val: "132626"
        string_val: "132564"
        string_val: "132665"
        string_val: "135082"
        string_val: "132869"
        string_val: "132847"
        string_val: "132830"
        string_val: "135070"
        string_val: "132851"
        string_val: "132845"
        string_val: "135108"
        string_val: "132854"
        string_val: "135054"
        string_val: "135071"
        string_val: "132583"
        string_val: "134992"
        string_val: "135021"
        string_val: "134987"
        string_val: "134983"
        string_val: "135001"
        string_val: "132768"
        string_val: "135045"
        string_val: "132847"
        string_val: "132846"
        string_val: "135026"
        string_val: "135032"
        string_val: "135085"
        string_val: "132845"
        string_val: "135038"
        string_val: "135057"
        string_val: "132858"
        string_val: "132869"
        string_val: "132846"
        string_val: "135069"
        string_val: "132851"
        string_val: "132866"
        string_val: "135108"
        string_val: "132854"
        string_val: "135054"
        string_val: "135066"
        string_val: "135041"
        string_val: "135028"
        string_val: "132862"
        string_val: "135042"
        string_val: "135052"
        string_val: "135047"
        string_val: "135064"
        string_val: "132834"
        string_val: "135106"
        string_val: "135032"
        string_val: "135085"
        string_val: "135062"
        string_val: "135079"
        string_val: "132754"
        string_val: "135039"
        string_val: "132856"
        string_val: "135030"
        string_val: "135028"
        string_val: "132572"
        string_val: "135032"
        string_val: "135086"
        string_val: "135085"
        string_val: "135074"
        string_val: "132723"
        string_val: "135058"
        string_val: "135046"
        string_val: "135075"
        string_val: "134999"
        string_val: "135021"
        string_val: "135013"
        string_val: "132767"
        string_val: "132825"
        string_val: "135060"
        string_val: "135027"
        string_val: "135085"
        string_val: "135038"
        string_val: "135066"
        string_val: "132937"
        string_val: "135042"
        string_val: "135052"
        string_val: "135085"
        string_val: "132925"
        string_val: "135062"
        string_val: "132872"
        string_val: "132921"
        string_val: "132875"
        string_val: "132951"
        string_val: "134996"
        string_val: "134999"
        string_val: "135013"
        string_val: "135011"
        string_val: "135001"
        string_val: "134976"
        string_val: "132767"
        string_val: "135019"
        string_val: "135028"
        string_val: "132572"
        string_val: "135045"
        string_val: "135085"
        string_val: "132921"
        string_val: "132951"
        string_val: "135065"
        string_val: "135038"
        string_val: "135030"
        string_val: "135046"
        string_val: "135075"
        string_val: "135053"
        string_val: "135066"
        string_val: "135064"
        string_val: "132834"
        string_val: "135085"
        string_val: "135079"
        string_val: "132872"
        string_val: "135058"
        string_val: "135065"
        string_val: "132754"
        string_val: "135038"
        string_val: "135030"
        string_val: "132732"
        string_val: "135104"
        string_val: "132733"
        string_val: "132560"
        string_val: "132630"
        string_val: "132584"
        string_val: "132825"
        string_val: "135063"
        string_val: "135025"
        string_val: "135060"
        string_val: "135028"
        string_val: "132862"
        string_val: "135042"
        string_val: "135052"
        string_val: "132834"
        string_val: "135032"
        string_val: "135039"
        string_val: "132856"
        string_val: "135030"
        string_val: "134996"
        string_val: "135016"
        string_val: "135109"
        string_val: "135088"
        string_val: "134986"
        string_val: "132767"
        string_val: "135018"
        string_val: "135019"
        string_val: "135027"
        string_val: "135041"
        string_val: "135052"
        string_val: "135106"
        string_val: "135032"
        string_val: "135039"
        string_val: "135073"
        string_val: "135051"
        string_val: "135038"
        string_val: "132856"
        string_val: "132955"
        string_val: "135053"
        string_val: "132958"
        string_val: "132861"
        string_val: "135026"
        string_val: "135086"
        string_val: "135079"
        string_val: "132921"
        string_val: "135058"
        string_val: "135049"
        string_val: "132954"
        string_val: "135034"
        string_val: "132884"
        string_val: "132825"
        string_val: "135063"
        string_val: "135060"
        string_val: "132862"
        string_val: "135052"
        string_val: "132834"
        string_val: "135059"
        string_val: "135079"
        string_val: "135058"
        string_val: "132754"
        string_val: "135038"
        string_val: "135060"
        string_val: "132862"
        string_val: "135052"
        string_val: "132572"
        string_val: "135064"
        string_val: "132834"
        string_val: "135080"
        string_val: "135062"
        string_val: "132951"
        string_val: "135065"
        string_val: "132954"
        string_val: "132740"
        string_val: "132732"
        string_val: "132609"
        string_val: "132560"
        string_val: "132608"
        string_val: "132594"
        string_val: "132584"
        string_val: "134975"
        string_val: "134983"
        string_val: "132768"
        string_val: "135053"
        string_val: "135042"
        string_val: "135047"
        string_val: "135064"
        string_val: "135079"
        string_val: "135058"
        string_val: "135065"
        string_val: "135076"
        string_val: "132830"
        string_val: "132834"
        string_val: "135086"
        string_val: "135062"
        string_val: "135079"
        string_val: "132921"
        string_val: "135038"
        string_val: "132856"
        string_val: "135076"
        string_val: "132583"
        string_val: "135021"
        string_val: "134986"
        string_val: "135001"
        string_val: "132768"
        string_val: "132654"
        string_val: "132561"
        string_val: "132706"
        string_val: "132665"
        string_val: "135109"
        string_val: "134992"
        string_val: "135021"
        string_val: "134983"
        string_val: "135001"
        string_val: "132768"
        string_val: "132663"
        string_val: "132740"
        string_val: "132732"
        string_val: "135104"
        string_val: "132660"
        string_val: "132667"
        string_val: "132560"
        string_val: "132594"
        string_val: "135025"
        string_val: "132572"
        string_val: "135032"
        string_val: "135086"
        string_val: "135085"
        string_val: "135058"
        string_val: "135108"
        string_val: "135038"
        string_val: "135057"
        string_val: "132654"
        string_val: "132561"
        string_val: "132626"
        string_val: "132706"
        string_val: "132825"
        string_val: "132861"
        string_val: "132572"
        string_val: "135080"
        string_val: "135086"
        string_val: "132875"
        string_val: "135035"
        string_val: "132884"
        string_val: "135075"
        string_val: "132825"
        string_val: "132955"
        string_val: "132958"
        string_val: "135041"
        string_val: "132572"
        string_val: "132834"
        string_val: "135048"
        string_val: "135026"
        string_val: "135080"
        string_val: "135086"
        string_val: "132921"
        string_val: "132723"
        string_val: "135058"
        string_val: "132754"
        string_val: "132954"
        string_val: "135034"
        string_val: "135046"
        string_val: "135075"
        string_val: "132825"
        string_val: "135063"
        string_val: "135060"
        string_val: "135041"
        string_val: "135028"
        string_val: "135042"
        string_val: "135052"
        string_val: "135045"
        string_val: "132834"
        string_val: "135106"
        string_val: "135032"
        string_val: "135085"
        string_val: "135058"
        string_val: "132856"
        string_val: "132825"
        string_val: "135050"
        string_val: "135042"
        string_val: "135081"
        string_val: "132885"
        string_val: "135059"
        string_val: "132872"
        string_val: "135055"
        string_val: "135043"
        string_val: "135076"
        string_val: "135086"
        string_val: "135055"
        string_val: "132723"
        string_val: "135035"
        string_val: "135049"
        string_val: "132884"
        string_val: "132825"
        string_val: "135025"
        string_val: "135027"
        string_val: "135028"
        string_val: "135052"
        string_val: "135032"
        string_val: "135085"
        string_val: "135062"
        string_val: "135051"
        string_val: "135038"
        string_val: "132862"
        string_val: "132861"
        string_val: "135045"
        string_val: "135026"
        string_val: "135085"
        string_val: "132723"
        string_val: "135058"
        string_val: "135035"
        string_val: "135072"
        string_val: "135030"
        string_val: "132861"
        string_val: "132572"
        string_val: "135044"
        string_val: "135026"
        string_val: "135085"
        string_val: "132921"
        string_val: "135058"
        string_val: "132951"
        string_val: "135065"
        string_val: "132825"
        string_val: "135025"
        string_val: "135028"
        string_val: "132572"
        string_val: "135047"
        string_val: "135048"
        string_val: "135106"
        string_val: "132754"
        string_val: "135051"
        string_val: "135075"
        string_val: "135011"
        string_val: "134987"
        string_val: "134976"
        string_val: "135066"
        string_val: "135050"
        string_val: "135082"
        string_val: "135042"
        string_val: "135081"
        string_val: "132830"
        string_val: "135070"
        string_val: "135069"
        string_val: "135043"
        string_val: "135076"
        string_val: "135057"
        string_val: "132825"
        string_val: "135060"
        string_val: "132862"
        string_val: "132861"
        string_val: "132885"
        string_val: "135032"
        string_val: "135085"
        string_val: "135079"
        string_val: "132921"
        string_val: "135038"
        string_val: "132856"
        string_val: "135046"
        string_val: "135027"
        string_val: "135042"
        string_val: "135039"
        string_val: "135073"
        string_val: "135038"
        string_val: "132613"
        string_val: "132663"
        string_val: "132740"
        string_val: "132732"
        string_val: "135104"
        string_val: "132733"
        string_val: "132630"
        string_val: "135000"
        string_val: "134996"
        string_val: "135021"
        string_val: "135001"
        string_val: "134976"
        string_val: "132768"
        string_val: "132740"
        string_val: "132668"
        string_val: "132715"
        string_val: "135060"
        string_val: "135042"
        string_val: "132834"
        string_val: "135032"
        string_val: "135085"
        string_val: "135079"
        string_val: "132872"
        string_val: "135058"
        string_val: "135038"
        string_val: "132856"
        string_val: "132825"
        string_val: "135025"
        string_val: "135042"
        string_val: "135052"
        string_val: "135045"
        string_val: "135064"
        string_val: "132834"
        string_val: "135059"
        string_val: "135085"
        string_val: "135079"
        string_val: "135065"
        string_val: "132754"
        string_val: "132825"
        string_val: "135041"
        string_val: "132937"
        string_val: "132862"
        string_val: "132755"
        string_val: "135064"
        string_val: "135059"
        string_val: "135080"
        string_val: "135079"
        string_val: "132723"
        string_val: "132754"
        string_val: "132922"
        string_val: "135075"
        string_val: "132875"
        string_val: "132877"
        string_val: "132884"
        string_val: "135060"
        string_val: "135041"
        string_val: "135052"
        string_val: "135081"
        string_val: "132885"
        string_val: "132834"
        string_val: "135106"
        string_val: "134996"
        string_val: "135109"
        string_val: "135088"
        string_val: "132768"
        string_val: "132870"
        string_val: "132869"
        string_val: "132851"
        string_val: "132866"
        string_val: "132845"
        string_val: "135054"
        string_val: "135071"
        string_val: "132877"
        string_val: "132861"
        string_val: "135064"
        string_val: "135086"
        string_val: "132872"
        string_val: "135055"
        string_val: "132723"
        string_val: "135058"
        string_val: "135035"
        string_val: "135072"
        string_val: "135034"
        string_val: "135025"
        string_val: "132955"
        string_val: "132958"
        string_val: "135064"
        string_val: "135026"
        string_val: "135086"
        string_val: "135055"
        string_val: "132723"
        string_val: "132875"
        string_val: "135072"
        string_val: "135075"
        string_val: "134975"
        string_val: "134996"
        string_val: "135021"
        string_val: "134987"
        string_val: "132564"
        string_val: "132715"
        string_val: "132717"
        string_val: "134999"
        string_val: "135013"
        string_val: "135011"
        string_val: "132767"
        string_val: "135019"
        string_val: "135082"
        string_val: "132830"
        string_val: "135070"
        string_val: "135069"
        string_val: "135108"
        string_val: "135054"
        string_val: "135071"
        string_val: "135057"
        string_val: "135053"
        string_val: "135066"
        string_val: "135050"
        string_val: "132885"
        string_val: "135062"
        string_val: "132872"
        string_val: "135055"
        string_val: "135058"
        string_val: "135043"
        string_val: "135076"
        string_val: "135053"
        string_val: "135060"
        string_val: "135064"
        string_val: "132925"
        string_val: "135079"
        string_val: "132872"
        string_val: "132921"
        string_val: "135058"
        string_val: "132875"
        string_val: "132951"
        string_val: "132954"
        string_val: "135063"
        string_val: "135025"
        string_val: "135060"
        string_val: "135052"
        string_val: "135081"
        string_val: "135045"
        string_val: "135040"
        string_val: "135032"
        string_val: "135062"
        string_val: "135073"
        string_val: "135051"
        string_val: "135038"
        string_val: "135033"
        string_val: "135057"
        string_val: "134996"
        string_val: "134986"
        string_val: "134983"
        string_val: "135001"
        string_val: "135018"
        string_val: "135032"
        string_val: "135085"
        string_val: "135079"
        string_val: "132854"
        string_val: "135038"
        string_val: "132856"
        string_val: "135057"
        string_val: "135046"
        string_val: "132870"
        string_val: "135082"
        string_val: "132858"
        string_val: "132869"
        string_val: "132847"
        string_val: "132851"
        string_val: "132845"
        string_val: "135108"
        string_val: "132854"
        string_val: "135071"
        string_val: "132877"
        string_val: "135066"
        string_val: "135060"
        string_val: "132862"
        string_val: "135042"
        string_val: "135052"
        string_val: "135045"
        string_val: "132834"
        string_val: "135106"
        string_val: "135032"
        string_val: "135085"
        string_val: "135062"
        string_val: "135051"
        string_val: "132856"
        string_val: "132654"
        string_val: "132561"
        string_val: "132626"
        string_val: "132706"
        string_val: "132665"
        string_val: "132825"
        string_val: "135063"
        string_val: "135028"
        string_val: "135042"
        string_val: "135032"
        string_val: "135085"
        string_val: "132872"
        string_val: "135058"
        string_val: "135038"
        string_val: "132856"
        string_val: "132755"
        string_val: "135048"
        string_val: "135000"
        string_val: "135016"
        string_val: "132825"
        string_val: "135041"
        string_val: "135041"
        string_val: "135082"
        string_val: "135081"
        string_val: "132825"
        string_val: "135053"
        string_val: "135000"
        string_val: "134996"
        string_val: "135063"
        string_val: "135066"
        string_val: "135060"
        string_val: "135060"
        string_val: "132572"
        string_val: "135085"
        string_val: "134996"
        string_val: "132613"
        string_val: "132740"
        string_val: "135063"
        string_val: "135060"
        string_val: "132825"
        string_val: "132572"
        string_val: "135048"
        string_val: "132862"
        string_val: "132825"
        string_val: "135063"
        string_val: "135025"
        string_val: "132663"
        string_val: "135066"
        string_val: "135050"
        string_val: "132740"
        string_val: "132613"
        string_val: "132663"
        string_val: "132660"
        string_val: "132733"
        string_val: "132958"
        string_val: "135028"
        string_val: "132862"
        string_val: "135000"
        string_val: "135060"
        string_val: "132870"
        string_val: "132825"
        string_val: "132862"
        string_val: "135064"
        string_val: "132955"
        string_val: "132958"
        string_val: "134999"
        string_val: "135066"
        string_val: "135050"
        string_val: "135041"
        string_val: "132825"
        string_val: "135027"
        string_val: "135028"
        string_val: "132825"
        string_val: "135025"
        string_val: "132825"
        string_val: "135053"
        string_val: "132755"
        string_val: "135025"
        string_val: "135060"
        string_val: "135041"
        string_val: "132663"
        string_val: "132740"
        string_val: "135066"
        string_val: "135060"
        string_val: "135042"
        string_val: "132740"
        string_val: "132825"
        string_val: "132958"
        string_val: "135028"
        string_val: "132583"
        string_val: "132870"
        string_val: "135082"
        string_val: "132825"
        string_val: "135060"
        string_val: "135027"
        string_val: "135041"
        string_val: "132825"
        string_val: "135025"
        string_val: "135041"
        string_val: "135025"
        string_val: "132572"
        string_val: "132825"
        string_val: "135066"
        string_val: "135050"
        string_val: "134975"
        string_val: "134992"
        string_val: "135052"
        string_val: "132830"
        string_val: "135025"
        string_val: "135066"
        string_val: "135082"
        string_val: "132613"
        string_val: "132663"
        string_val: "135082"
        string_val: "132830"
        string_val: "135082"
        string_val: "132858"
        string_val: "135050"
        string_val: "135081"
        string_val: "135070"
        string_val: "132613"
        string_val: "134986"
        string_val: "132825"
        string_val: "135060"
        string_val: "135041"
        string_val: "135025"
        string_val: "132862"
        string_val: "135052"
        string_val: "132825"
        string_val: "132862"
        string_val: "135042"
        string_val: "132755"
        string_val: "132825"
        string_val: "132937"
        string_val: "132862"
        string_val: "132654"
        string_val: "132862"
        string_val: "132572"
        string_val: "135047"
        string_val: "132825"
        string_val: "132572"
        string_val: "135047"
        string_val: "135064"
        string_val: "135041"
        string_val: "135052"
        string_val: "132830"
        string_val: "132613"
        string_val: "132870"
        string_val: "132825"
        string_val: "132955"
        string_val: "135028"
        string_val: "132660"
        string_val: "132825"
        string_val: "135041"
        string_val: "132862"
        string_val: "134999"
        string_val: "132572"
        string_val: "132755"
        string_val: "135028"
        string_val: "135064"
        string_val: "132834"
        string_val: "135026"
        string_val: "135104"
        string_val: "134996"
        string_val: "132825"
        string_val: "135025"
        string_val: "135060"
      }
    }
  }
}
node {
  name: "normalize_element/component_1"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 736
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 736
          }
        }
        tensor_content: "^:\261A\3233\261A\2065\261A\222\346\275A\357\330\275A\366\344\275A*6\261AB!\261A\232\'\261A\3614\261A-9\261AP\030\261A\246\002\261A\014\027\261AX\032\261A\001 \261A\321\002\261A\332`\227AT~\227A\342w\227A9v\227A\331\226\227A\355\210\227A\374g\227A\2435\261A\232\'\261A`#\261Aw0\261AH8\261A\3304\261A\246\002\261A\306>\261A\376*\261A\343\014\261AB!\261A`#\261A\374\036\261AP\030\261A8!\261A\014\027\261AX\032\261A\001 \261A\310X\261A_5\261A[,\261A\2044\261A]F\261A65\261A\0265\261A\315<\261As@\261A\2332\261AH8\261A\3304\261A\311:\261AB@\261A\221.\261A\312*\261A\0066\261A\334.\261A[,\261A\030\"\261AH8\261A\241!\261A\3304\261A\2202\261A\0041\261A\037S\261AX!\261A\330\035\261A\310R\227A\342w\227A\353V\227A\204\016\227A\334-\261ALA\261AZ-\261A\3304\261A\306>\261A\310X\261A=3\261A]F\261A65\261A\3304\261A^:\261A\311:\261A\206c\261A\3233\261A\3772\261A]<\261A/c\227A\310R\227A\353V\227A\356H\227A\355\210\227AOU\227A\204\016\227A\006\000\227A[,\261A\030\"\261A\2435\261A\3304\261A\3233\261A]<\261AW2\261A\306>\261A\334.\261AX!\261A\330\035\261Asn\261A\310X\261A\315<\261As@\261A\3304\261AB@\261A\206c\261A\037S\261AW2\261A\221.\261A\306>\261A\334.\261A\354\010\276A\033\006\276A\213\005\276A\270\004\276A\000\006\276A\330\004\276A\334-\261A\371@\261AG2\261ALA\261A[,\261A\2044\261A]F\261A65\261As@\261AH8\261A\312*\261A\0066\261A\334.\261A/c\227Al\364\226A\321_\227A\022\002\227A.n\227A\204\016\227A\340\340\226A\006\000\227AZ-\261A_5\261A65\261A\2332\261AH8\261A\312*\261Aj-\261A\2435\261A\306>\261A\0066\261AT.\261Asn\261A\353(\261AM/\261Aw0\261A\241!\261AB@\261A\3233\261A\037S\261A\201\024\261AvH\261A\307\037\261A\333\035\261A\334-\261A\371@\261ALA\261A\2044\261A65\261As@\261A.)\261AB@\261A\037S\261A\221.\261A\306>\261ALA\261A\2044\261A65\261A\030\"\261A\315<\261As@\261A\372(\261A\311:\261A]<\261AW2\261AvH\261A\200\004\276A\354\010\276A\010\025\276A\270\004\276A\010\022\276Ap\004\276A\330\004\276A\321\206\227A\331\226\227A\374g\227Asn\261A]F\261A\0265\261A\315<\261AB@\261A\037S\261AW2\261A\271r\261A\3614\261As@\261A\241!\261A\311:\261AB@\261A\3233\261A\306>\261A\0066\261A\271r\261A\332`\227A\342w\227A.n\227A\355\210\227A\374g\227AZ\342\275A\206\320\275Ao\325\275A\366\344\275A\321_\227AT~\227A\342w\227A\331\226\227A\355\210\227A\374g\227A$\005\276A\200\004\276A\354\010\276A\033\006\276A\007\006\276A\206\005\276A\270\004\276Ap\004\276AG2\261A\030\"\261AH8\261A\241!\261A\3304\261A\037S\261A\014\027\261A\306>\261A\376*\261AZ\342\275A\206\320\275A\222\346\275Ao\325\275A\334-\261AM/\261A\030\"\261A\372(\261A\241!\261A\3772\261A\240*\261A\333\035\261A\330\035\261A\334-\261AT.\261A\353(\261A_5\261A\030\"\261As@\261A\332\"\261Aw0\261A\372(\261A\241!\261A\3233\261A\0041\261A\037S\261A\221.\261AvH\261A\307\037\261AX!\261A\330\035\261A\334-\261A\371@\261ALA\261A_5\261A[,\261A]F\261A65\261A\2435\261As@\261A\2332\261AH8\261A\3304\261A\037S\261A\0066\261A\334-\261A+f\261A]F\261A\231Q\261A\247o\261A.)\261A\206c\261A\3320\261An|\261A\271r\261A\241!\261A\3320\261A\0041\261A\240*\261A\201\024\261A\333\035\261A\334-\261AG2\261AZ-\261A[,\261A65\261AH8\261A\3304\261A\311:\261A\2435\261A\306>\261A\2044\261AM/\261A\2435\261Aw0\261A\3304\261A\0041\261A\037S\261A\240*\261A\2141\261A\334.\261AM/\261A\030\"\261A\201\"\261Aw0\261A\3304\261A\3233\261A\037S\261A]<\261AW2\261A\334-\261AG2\261A[,\261A\030\"\261A\0265\261A\332\"\261A\2332\261A\221.\261A\2435\261A\330\035\261A\356H\227A9v\227AOU\227A\310X\261A+f\261A*6\261A]F\261A\231Q\261A\3614\261A-9\261A\374\036\261An|\261A\271r\261A\376*\261A\334-\261ALA\261A\2044\261AM/\261A\247o\261AH8\261A\3304\261AB@\261A\3233\261A\306>\261A\0066\261AX!\261AZ-\261A]F\261A\312*\261Aj-\261A\306>\261A\362\005\276A$\005\276A\200\004\276A\354\010\276A\033\006\276A\213\005\276A\000\006\276A\353\366\226A/c\227A\342w\227A\355\210\227AOU\227A\374g\227A\200\004\276A\334\347\275A\000\334\275ALA\261A]F\261As@\261AH8\261A\3304\261AB@\261A\206c\261A\037S\261A\306>\261A\0066\261A\334-\261AG2\261A]F\261A65\261A\2435\261A\315<\261As@\261A.)\261A\3304\261AB@\261AW2\261A\221.\261A\334-\261A_5\261A=3\261A\2044\261A\002:\261A\315<\261A.)\261A\372(\261AB@\261A\0041\261A\221.\261A\2065\261A\330\035\261A\3772\261A:\025\261A\333\035\261ALA\261A_5\261A65\261A\231Q\261A\247o\261As@\261A\2332\261A/c\227A\321_\227A\022\002\227A\374g\227A\006%\261AB!\261AP\030\261A8!\261A\246\002\261A\001 \261A\321\002\261A:\025\261AM/\261A\315<\261A\241!\261A\206c\261A\3320\261A\0041\261A\037S\261A\240*\261A\2141\261A\307\037\261AG2\261AT.\261A\353(\261A\315<\261Aw0\261A\241!\261A\3320\261A\0041\261A\3772\261A\2141\261A\330\035\261A\321\206\227A/c\227A\342w\227A9v\227A\357\330\275A\000\334\275A\332\332\275A\310R\227A\353V\227A\356H\227A\204\016\227A\006\000\227A*6\261A\3614\261A-9\261A\374\036\261A\014\027\261A\001 \261A\321\002\261A\376*\261Asn\261A\310X\261A+f\261A\247o\261A\311:\261A\206c\261A\3320\261A\037S\261An|\261A\271r\261Asn\261ALA\261A\315<\261A^:\261AB@\261A\206c\261A\3233\261A\037S\261A\3772\261A]<\261AvH\261A\371@\261AG2\261ALA\261A65\261A\231Q\261A\2435\261A\276\025\261AH8\261A\311:\261Aj-\261A\2435\261A\306>\261A\004\"\261A\376*\261A/c\227A.n\227A\331\226\227A\355\210\227A\340\340\226AH8\261A\3304\261AB@\261AX\032\261A\306>\261A\0066\261A\376*\261AX!\261A\006%\261A*6\261A\343\014\261AB!\261A\232\'\261AP\030\261A\246\002\261A\014\027\261AX\032\261A\321\002\261A:\025\261A\310X\261ALA\261A\2044\261A]F\261A65\261A\2435\261As@\261A\2332\261AH8\261A\3304\261A\311:\261A\2435\261A\0066\261AZ\342\275A\206\320\275A\222\346\275Ao\325\275A\366\344\275A\334-\261A\371@\261A[,\261A]F\261AH8\261A\3304\261A\206c\261A\037S\261A\306>\261A\0066\261A\002:\261A\332\"\261A\353\366\226Al\364\226A\334-\261A_5\261A_5\261A*6\261A\231Q\261A\334-\261Asn\261A\353\366\226A/c\227A\371@\261A\310X\261ALA\261ALA\261A\030\"\261A\3304\261A/c\227A\362\005\276A\200\004\276A\371@\261ALA\261A\334-\261A\030\"\261A\332\"\261A\2044\261A\334-\261A\371@\261AG2\261A$\005\276A\310X\261A+f\261A\200\004\276A\362\005\276A$\005\276A\007\006\276A\213\005\276A\353(\261A[,\261A\2044\261A\353\366\226ALA\261A\006%\261A\334-\261A\2044\261A\315<\261AT.\261A\353(\261A\310R\227A\310X\261A+f\261A_5\261A\334-\261AZ-\261A[,\261A\334-\261AG2\261A\334-\261Asn\261A\002:\261AG2\261ALA\261A_5\261A$\005\276A\200\004\276A\310X\261ALA\261A]F\261A\200\004\276A\334-\261A\353(\261A[,\261A\332`\227A\006%\261A*6\261A\334-\261ALA\261AZ-\261A_5\261A\334-\261AG2\261A_5\261AG2\261A\030\"\261A\334-\261A\310X\261A+f\261A\321\206\227AT~\227A65\261A\3614\261AG2\261A\310X\261A*6\261A\362\005\276A$\005\276A*6\261A\3614\261A*6\261A\343\014\261A+f\261A\231Q\261A-9\261A\362\005\276A.n\227A\334-\261ALA\261A_5\261AG2\261A\2044\261A65\261A\334-\261A\2044\261A]F\261A\002:\261A\334-\261A=3\261A\2044\261AZ\342\275A\2044\261A\030\"\261A\0265\261A\334-\261A\030\"\261A\0265\261A\315<\261A_5\261A65\261A\3614\261A\362\005\276A\006%\261A\334-\261AT.\261A[,\261A\007\006\276A\334-\261A_5\261A\2044\261A\310R\227A\030\"\261A\002:\261A[,\261A\315<\261As@\261Aw0\261A\033\006\276A/c\227A\334-\261AG2\261ALA\261A"
      }
    }
  }
}
node {
  name: "normalize_element/component_2"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 736
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 736
          }
        }
        tensor_content: "\326\363\311\302p\372\311\302\362\366\311\3020E\306\302VJ\306\302\273D\306\302\210\324\311\302\r\331\311\302\361\337\311\302\'\341\311\302\220\324\311\302\200\336\311\3023\315\311\302\377\335\311\302l\340\311\302\321\324\311\302e\322\311\302\372w\306\302\247~\306\302\353q\306\302Os\306\302\201x\306\302\336{\306\302\034w\306\302\255\366\311\302\361\337\311\302\244\342\311\302\247\000\312\302m\362\311\302\"\367\311\3023\315\311\302\236\364\311\302\005\351\311\302\330\337\311\302\r\331\311\302\244\342\311\302\306\343\311\302\200\336\311\302\325\334\311\302\377\335\311\302l\340\311\302\321\324\311\302\347\361\311\302\220\364\311\302u\371\311\302Z\371\311\302c\362\311\302o\364\311\302\327\374\311\302E\376\311\302\231\370\311\302\302\363\311\302m\362\311\302\"\367\311\302D\365\311\302(\377\311\3022\373\311\302\"\363\311\302\003\363\311\302\234\372\311\302u\371\311\302E\374\311\302m\362\311\302%\007\312\302\"\367\311\302\302\377\311\302)\n\312\302\247\000\312\302\204\001\312\302\256\373\311\302\247^\306\302\353q\306\302\367T\306\302xS\306\302X\367\311\302\374\364\311\302\361\362\311\302\"\367\311\302\236\364\311\302\347\361\311\302\270\365\311\302c\362\311\302o\364\311\302\"\367\311\302\326\363\311\302D\365\311\302=\375\311\302p\372\311\302\321\374\311\302\274\370\311\302\316n\306\302\247^\306\302\367T\306\302\316V\306\302\336{\306\302Ht\306\302xS\306\302\240Q\306\302u\371\311\302E\374\311\302\255\366\311\302\"\367\311\302p\372\311\302\274\370\311\302\306\377\311\302\236\364\311\302\234\372\311\302\204\001\312\302\256\373\311\302\226\006\312\302\347\361\311\302E\376\311\302\231\370\311\302\"\367\311\302(\377\311\302=\375\311\302\247\000\312\302\306\377\311\3022\373\311\302\236\364\311\302\234\372\311\302\263W\306\302=V\306\302<S\306\302vU\306\3026T\306\302\241T\306\302X\367\311\302|\363\311\302\270\364\311\302\374\364\311\302u\371\311\302Z\371\311\302c\362\311\302o\364\311\302\231\370\311\302m\362\311\302\"\363\311\302\003\363\311\302\234\372\311\302\316n\306\302~k\306\302\200x\306\302\225p\306\302\241z\306\302xS\306\302\277q\306\302\240Q\306\302\361\362\311\302\220\364\311\302o\364\311\302\302\363\311\302m\362\311\302\"\363\311\302\323\362\311\302A\364\311\302\236\364\311\302\003\363\311\302C\005\312\302\226\006\312\302\351\002\312\302\334\010\312\302\247\000\312\302%\007\312\302(\377\311\302p\372\311\302\247\000\312\302\245\016\312\302\341\371\311\302\370\n\312\302G\016\312\302X\367\311\302|\363\311\302\374\364\311\302Z\371\311\302o\364\311\302\231\370\311\302\246\372\311\302(\377\311\302\247\000\312\3022\373\311\302\236\364\311\302\374\364\311\302Z\371\311\302o\364\311\302E\374\311\302E\376\311\302\231\370\311\302\366\376\311\302D\365\311\302\274\370\311\302\306\377\311\302\341\371\311\302QU\306\302\263W\306\302\354T\306\302vU\306\302\214T\306\302\330T\306\302\241T\306\302Ln\306\302\201x\306\302\034w\306\302\226\006\312\302c\362\311\302\327\374\311\302E\376\311\302(\377\311\302\247\000\312\302\306\377\311\302~\362\311\302\'\341\311\302\231\370\311\302%\007\312\302D\365\311\302(\377\311\302p\372\311\302\236\364\311\302\003\363\311\302~\362\311\302\372w\306\302\353q\306\302\241z\306\302\336{\306\302\034w\306\302YB\306\302\305@\306\302\304C\306\302\273D\306\302\200x\306\302\247~\306\302\353q\306\302\201x\306\302\336{\306\302\034w\306\302{U\306\302QU\306\302\263W\306\302=V\306\302QT\306\302\244S\306\302vU\306\302\330T\306\302\270\364\311\302E\374\311\302m\362\311\302%\007\312\302\"\367\311\302\247\000\312\302\377\335\311\302\236\364\311\302\005\351\311\302YB\306\302\305@\306\3020E\306\302\304C\306\302X\367\311\302\334\010\312\302E\374\311\302\366\376\311\302%\007\312\302\321\374\311\302;\t\312\302G\016\312\302\256\373\311\302X\367\311\302C\005\312\302\351\002\312\302\220\364\311\302E\374\311\302\231\370\311\302\235\377\311\302\247\000\312\302\366\376\311\302%\007\312\302p\372\311\302)\n\312\302\247\000\312\3022\373\311\302\341\371\311\302\370\n\312\302\204\001\312\302\256\373\311\302X\367\311\302|\363\311\302\374\364\311\302\220\364\311\302u\371\311\302c\362\311\302o\364\311\302\255\366\311\302\231\370\311\302\302\363\311\302m\362\311\302\"\367\311\302\247\000\312\302\003\363\311\302X\367\311\302\020\361\311\302c\362\311\302\306\353\311\302\270\352\311\302\246\372\311\302=\375\311\302V\004\312\302\230\343\311\302~\362\311\302%\007\312\302V\004\312\302)\n\312\302;\t\312\302\245\016\312\302G\016\312\302X\367\311\302\270\364\311\302\361\362\311\302u\371\311\302o\364\311\302m\362\311\302\"\367\311\302D\365\311\302A\364\311\302\236\364\311\302Z\371\311\302\334\010\312\302\255\366\311\302\247\000\312\302\"\367\311\302)\n\312\302\247\000\312\302;\t\312\302\201\001\312\302\234\372\311\302\334\010\312\302E\374\311\302\265\376\311\302\247\000\312\302\"\367\311\302p\372\311\302\247\000\312\302\274\370\311\302\306\377\311\302X\367\311\302\270\364\311\302u\371\311\302E\374\311\302\327\374\311\302\235\377\311\302\302\363\311\3022\373\311\302A\364\311\302\256\373\311\302\316V\306\302Os\306\302Ht\306\302\347\361\311\302\020\361\311\302\210\324\311\302c\362\311\302\306\353\311\302\'\341\311\302\220\324\311\302\306\343\311\302\230\343\311\302~\362\311\302\005\351\311\302X\367\311\302\374\364\311\302Z\371\311\302\334\010\312\302\270\352\311\302m\362\311\302\"\367\311\302(\377\311\302p\372\311\302\236\364\311\302\003\363\311\302\204\001\312\302\361\362\311\302c\362\311\302\"\363\311\302\323\362\311\302\236\364\311\302\205T\306\302{U\306\302QU\306\302\263W\306\302=V\306\302<S\306\3026T\306\3021t\306\302\316n\306\302\353q\306\302\336{\306\302Ht\306\302\034w\306\302QU\306\302\315M\306\302<Q\306\302\374\364\311\302c\362\311\302\231\370\311\302m\362\311\302\"\367\311\302(\377\311\302=\375\311\302\247\000\312\302\236\364\311\302\003\363\311\302X\367\311\302\270\364\311\302c\362\311\302o\364\311\302\255\366\311\302E\376\311\302\231\370\311\302\246\372\311\302\"\367\311\302(\377\311\302\306\377\311\3022\373\311\302X\367\311\302\220\364\311\302\270\365\311\302Z\371\311\302\002\n\312\302E\376\311\302\246\372\311\302\366\376\311\302(\377\311\302)\n\312\3022\373\311\302\362\366\311\302\256\373\311\302\321\374\311\302\261\336\311\302G\016\312\302\374\364\311\302\220\364\311\302o\364\311\302\306\353\311\302\270\352\311\302\231\370\311\302\302\363\311\302\316n\306\302\200x\306\302\225p\306\302\034w\306\302\367\336\311\302\r\331\311\302\200\336\311\302\325\334\311\3023\315\311\302\321\324\311\302e\322\311\302\261\336\311\302\334\010\312\302E\376\311\302%\007\312\302=\375\311\302V\004\312\302)\n\312\302\247\000\312\302;\t\312\302\201\001\312\302\370\n\312\302\270\364\311\302C\005\312\302\351\002\312\302E\376\311\302\247\000\312\302%\007\312\302V\004\312\302)\n\312\302\321\374\311\302\201\001\312\302\256\373\311\302Ln\306\302\316n\306\302\353q\306\302Os\306\302VJ\306\302<Q\306\302\006M\306\302\247^\306\302\367T\306\302\316V\306\302xS\306\302\240Q\306\302\210\324\311\302\'\341\311\302\220\324\311\302\306\343\311\302\377\335\311\302\321\324\311\302e\322\311\302\005\351\311\302\226\006\312\302\347\361\311\302\020\361\311\302\270\352\311\302D\365\311\302=\375\311\302V\004\312\302\247\000\312\302\230\343\311\302~\362\311\302\226\006\312\302\374\364\311\302E\376\311\302\326\363\311\302(\377\311\302=\375\311\302p\372\311\302\247\000\312\302\321\374\311\302\274\370\311\302\341\371\311\302|\363\311\302\270\364\311\302\374\364\311\302o\364\311\302\306\353\311\302\255\366\311\302~\360\311\302m\362\311\302D\365\311\302\323\362\311\302A\364\311\302\236\364\311\302@\362\311\302\005\351\311\302\316n\306\302\241z\306\302\201x\306\302\336{\306\302\277q\306\302m\362\311\302\"\367\311\302(\377\311\302l\340\311\302\236\364\311\302\003\363\311\302\005\351\311\302\204\001\312\302\367\336\311\302\210\324\311\302\330\337\311\302\r\331\311\302\361\337\311\302\200\336\311\3023\315\311\302\377\335\311\302l\340\311\302e\322\311\302\261\336\311\302\347\361\311\302\374\364\311\302Z\371\311\302c\362\311\302o\364\311\302\255\366\311\302\231\370\311\302\302\363\311\302m\362\311\302\"\367\311\302D\365\311\302A\364\311\302\003\363\311\302YB\306\302\305@\306\3020E\306\302\304C\306\302\273D\306\302X\367\311\302|\363\311\302u\371\311\302c\362\311\302m\362\311\302\"\367\311\302=\375\311\302\247\000\312\302\236\364\311\302\003\363\311\302\002\n\312\302\235\377\311\3021t\306\302~k\306\302X\367\311\302\220\364\311\302\220\364\311\302\210\324\311\302\306\353\311\302X\367\311\302\226\006\312\3021t\306\302\316n\306\302|\363\311\302\347\361\311\302\374\364\311\302\374\364\311\302E\374\311\302\"\367\311\302\316n\306\302\205T\306\302QU\306\302|\363\311\302\374\364\311\302X\367\311\302E\374\311\302\235\377\311\302Z\371\311\302X\367\311\302|\363\311\302\270\364\311\302{U\306\302\347\361\311\302\020\361\311\302QU\306\302\205T\306\302{U\306\302QT\306\302<S\306\302\351\002\312\302u\371\311\302Z\371\311\3021t\306\302\374\364\311\302\367\336\311\302X\367\311\302Z\371\311\302E\376\311\302C\005\312\302\351\002\312\302\247^\306\302\347\361\311\302\020\361\311\302\220\364\311\302X\367\311\302\361\362\311\302u\371\311\302X\367\311\302\270\364\311\302X\367\311\302\226\006\312\302\002\n\312\302\270\364\311\302\374\364\311\302\220\364\311\302{U\306\302QU\306\302\347\361\311\302\374\364\311\302c\362\311\302QU\306\302X\367\311\302\351\002\312\302u\371\311\302\372w\306\302\367\336\311\302\210\324\311\302X\367\311\302\374\364\311\302\361\362\311\302\220\364\311\302X\367\311\302\270\364\311\302\220\364\311\302\270\364\311\302E\374\311\302X\367\311\302\347\361\311\302\020\361\311\302Ln\306\302\247~\306\302o\364\311\302\'\341\311\302\270\364\311\302\347\361\311\302\210\324\311\302\205T\306\302{U\306\302\210\324\311\302\'\341\311\302\210\324\311\302\330\337\311\302\020\361\311\302\306\353\311\302\220\324\311\302\205T\306\302\241z\306\302X\367\311\302\374\364\311\302\220\364\311\302\270\364\311\302Z\371\311\302o\364\311\302X\367\311\302Z\371\311\302c\362\311\302\002\n\312\302X\367\311\302\270\365\311\302Z\371\311\302YB\306\302Z\371\311\302E\374\311\302\327\374\311\302X\367\311\302E\374\311\302\327\374\311\302E\376\311\302\220\364\311\302o\364\311\302\'\341\311\302\205T\306\302\367\336\311\302X\367\311\302C\005\312\302u\371\311\302QT\306\302X\367\311\302\220\364\311\302Z\371\311\302\247^\306\302E\374\311\302\002\n\312\302u\371\311\302E\376\311\302\231\370\311\302\247\000\312\302=V\306\302\316n\306\302X\367\311\302\270\364\311\302\374\364\311\302"
      }
    }
  }
}
node {
  name: "normalize_element/component_3"
  op: "Const"
  device: "/device:CPU:0"
  attr {
    key: "_output_shapes"
    value {
      list {
        shape {
          dim {
            size: 736
          }
        }
      }
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_STRING
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_STRING
        tensor_shape {
          dim {
            size: 736
          }
        }
        string_val: "medium"
        string_val: "low"
        string_val: "medium"
        string_val: "medium"
        string_val: "low"
        string_val: "low"
        string_val: "medium"
        string_val: "medium"
        string_val: "low"
        string_val: "low"
        string_val: "medium"
        string_val: "low"
        string_val: "medium"
        string_val: "low"
        string_val: "medium"
        string_val: "high"
        string_val: "medium"
        string_val: "low"
        string_val: "high"
        string_val: "low"
        string_val: "medium"
        string_val: "high"
        string_val: "medium"
        string_val: "medium"
        string_val: "high"
        string_val: "low"
        string_val: "low"
        string_val: "high"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "low"
        string_val: "medium"
        string_val: "low"
        string_val: "low"
        string_val: "low"
        string_val: "medium"
        string_val: "low"
        string_val: "medium"
        string_val: "high"
        string_val: "high"
        string_val: "medium"
        string_val: "medium"
        string_val: "high"
        string_val: "medium"
        string_val: "high"
        string_val: "high"
        string_val: "high"
        string_val: "low"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "high"
        string_val: "medium"
        string_val: "low"
        string_val: "low"
        string_val: "medium"
        string_val: "medium"
        string_val: "low"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "high"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "low"
        string_val: "low"
        string_val: "medium"
        string_val: "low"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "high"
        string_val: "low"
        string_val: "medium"
        string_val: "high"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "low"
        string_val: "high"
        string_val: "low"
        string_val: "medium"
        string_val: "medium"
        string_val: "low"
        string_val: "medium"
        string_val: "medium"
        string_val: "low"
        string_val: "medium"
        string_val: "low"
        string_val: "medium"
        string_val: "low"
        string_val: "high"
        string_val: "medium"
        string_val: "low"
        string_val: "low"
        string_val: "high"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "high"
        string_val: "high"
        string_val: "high"
        string_val: "low"
        string_val: "medium"
        string_val: "high"
        string_val: "medium"
        string_val: "medium"
        string_val: "high"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "low"
        string_val: "medium"
        string_val: "medium"
        string_val: "low"
        string_val: "low"
        string_val: "medium"
        string_val: "low"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "high"
        string_val: "medium"
        string_val: "high"
        string_val: "low"
        string_val: "medium"
        string_val: "low"
        string_val: "low"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "low"
        string_val: "high"
        string_val: "medium"
        string_val: "medium"
        string_val: "low"
        string_val: "medium"
        string_val: "medium"
        string_val: "high"
        string_val: "medium"
        string_val: "medium"
        string_val: "low"
        string_val: "high"
        string_val: "low"
        string_val: "medium"
        string_val: "low"
        string_val: "low"
        string_val: "high"
        string_val: "low"
        string_val: "medium"
        string_val: "high"
        string_val: "medium"
        string_val: "high"
        string_val: "low"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "low"
        string_val: "low"
        string_val: "medium"
        string_val: "medium"
        string_val: "high"
        string_val: "high"
        string_val: "low"
        string_val: "medium"
        string_val: "high"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "medium"
        string_val: "high"
        string_val: "high"
        string_val: "low"
        string_val: "high"
        string_val: "low"
        string_val: "high"
        string_val: "medium"
        string_val: "low"
        string_val: "high"
        string_val: "medium"
        string_val: "low"
        string_val: "low"
        string_val: "low"
        string_val: "low"
        string_val: "low"
        string_val: "low"
        string_val: "medium"
